//  alert('Hello, World');
//  console.log (alert)

// Создайте переменную num и присвойте ей значение 123. Выведите значение этой переменной в консоль
// Создайте переменную а и присвойте ей значение 5, переопределите переменную а на значение 7, выведите переменную а в консоль
// Создайте переменную b. Запишите в нее сумму чисел 1, 2 и 3. С помощью функции console.log выведите в консоль содержимое переменной b.
// Создайте 2 вида комментариев в вашем коде, добавьте в них произвольный текст

// console.log('Текст из script.js!');

// const num = 123;
// console.log(num);

// let a = 5;
// a = 7;
// console.log(a);

// const b = 1+2+3;
// console.log(b);

// Создайте переменную c со значением 10 и переменную d со значением 2. 
// Все созданные переменные должны быть логично названы
// Создайте переменную суммы и присвойте сумму чисел (c,d)
// Создайте переменную разности и присвойте разность чисел (c,d)
// Создайте переменную произведения и присвойте произведение чисел (c,d)
// Создайте переменную частного и присвойте деление чисел (c,d)
// Выведите в консоль все созданные переменные
// Сложите все созданные переменные и выведите результат в консоль

// let c = 10;
// let d = 2;
// let sum = c + d;
// console.log(sum);
// let sub = c - d;
// console.log(sub);
// let mult = c * d;
// console.log(mult); 
// let del = c / d;
// console.log(del);  
// sumAll = sum + sub + mult + del;
// console.log(sumAll);

// let a = 1.5 ;
// let b = 0.75;
// sum = a + b ;
// console.log(sum);

// let c = 6;
// console.log(c * -1);

// const name = ('Arsenyi')
// const surname = ('Popov')
// console.log(name,surname);

// let java = ('java')
// let script = ('script')
// sum = java + script

// console.log(sum); 

// let hello = ('hello ')
// let world = ('world')
// sum = hello + world

// console.log(sum); 

// Задание 1
// Необходимо создать переменную в которой будет храниться температура в градусах Цельсия, преобразовать значение в температуру по фаренгейту.
// Формула перевода градусов Цельсия в градусы Фаренгейта: градусы Фаренгейта = (9 / 5) * градусы Цельсия + 32
// Вывести в консоль температуру в Цельсиях и Фаренгейтах.

// Задание 2
// Необходимо создать переменную name, записать в эту переменную свое имя. Необходимо также создать переменную admin и присвоить этой переменной значение из переменной name. Вывести значение переменной admin в консоль.





